In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1,2,3,4],
                    'col2': [444,555,666,444],
                    'col3': ['abc', 'def', 'ghi','xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
#to get all unique values from a column use unique()
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
#to get number of unique values in a column, use len() or nunique()
print(df['col2'].nunique())
print(len(df['col2'].unique()))

3
3

In [5]:
#to get values and number of times it appears in the df use value_counts()
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [6]:
#to define your own functions and use them with pandas, use apply()
def times2(x):
    return x*2

print(df['col1'].apply(times2),'\n\n')

print(df['col3'].apply(len),'\n\n')

print(df['col2'].apply(lambda x: x*2))

0    2
1    4
2    6
3    8
Name: col1, dtype: int64


0    3
1    3
2    3
3    3
Name: col3, dtype: int64


0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [7]:
#to get a list of columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [8]:
#to sort the dataframe according to values use sort_values()
df.sort_values('col2')#note that the index remains the same

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [9]:
#to check for null values in the dataframe use isnull()
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [11]:
#to pivot table use pivot_table(values, index, columns)
df.pivot_table(values='col2', index='col1', columns='col3')

col3    abc    def    ghi    xyz
col1
1     444.0    NaN    NaN    NaN
2       NaN  555.0    NaN    NaN
3       NaN    NaN  666.0    NaN
4       NaN    NaN    NaN  444.0

In [4]:
#to get number of times every value has been encountered, use value_counts()
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64